Repository: yujinchuan2021-max/zhenxing-ai-assistant
Catalog: TubaWinUi3.WinUI3/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# App_Title
source: Zhenxing AI Assistant
zh_cn: 枕星图吧AI助手

# Common_UnknownError
source: Unknown error
zh_cn: 未知错误

# Common_Unknown
source: Unknown
zh_cn: 未知

# Common_NoDescription
source: No description yet.
zh_cn: 暂无介绍。

# Common_Builtin
source: Built-in
zh_cn: 内置

# Common_Open
source: Open
zh_cn: 打开

# Common_Download
source: Download
zh_cn: 下载

# Common_Installing
source: Installing...
zh_cn: 安装中...

# Common_InstallingTitle
source: Installing
zh_cn: 正在安装

# Common_InstallDone
source: Installed
zh_cn: 安装完成

# Common_InstallFailed
source: Installation failed
zh_cn: 安装失败

# Common_Launched
source: Launched
zh_cn: 已启动

# Common_LaunchedAsAdmin
source: Launched as administrator
zh_cn: 已以管理员身份启动

# Common_LaunchFailed
source: Launch failed
zh_cn: 启动失败

# Common_Opened
source: Opened
zh_cn: 已打开

# Common_Created
source: Created
zh_cn: 已创建

# Common_CreateFailed
source: Failed to create
zh_cn: 创建失败

# Common_DesktopShortcutCreated
source: Desktop shortcut for "{0}" created
zh_cn: 已将「{0}」快捷方式发送到桌面

# Common_Deleted
source: Deleted
zh_cn: 已删除

# Common_DeletedMessage
source: "{0}" has been deleted
zh_cn: 「{0}」已删除

# Common_DeleteFailed
source: Failed to delete
zh_cn: 删除失败

# Common_ImportFailed
source: Import failed
zh_cn: 导入失败

# Common_ImportSuccess
source: Imported
zh_cn: 导入成功

# Common_Favorite
source: Favorite
zh_cn: 收藏

# Common_Unfavorite
source: Unfavorite
zh_cn: 取消收藏

# Common_Done
source: Done
zh_cn: 完成

# Common_All
source: All
zh_cn: 全部

# Common_Default
source: Default
zh_cn: 默认

# Common_Delete
source: Delete
zh_cn: 删除

# Common_Cancel
source: Cancel
zh_cn: 取消

# Common_Confirm
source: OK
zh_cn: 确定

# Common_Close
source: Close
zh_cn: 关闭

# Common_SendToDesktop.Text
source: Send to Desktop
zh_cn: 发送到桌面快捷方式

# Common_RunAsAdmin.Text
source: Run as Administrator
zh_cn: 以管理员身份运行

# Common_OpenLocation.Text
source: Open File Location
zh_cn: 打开工具所在目录

# Common_OpenTutorial.Text
source: Open Tutorial
zh_cn: 打开教程

# Common_SelectArch.Text
source: Select Architecture
zh_cn: 选择架构

# Common_DeleteTool.Text
source: Delete Tool
zh_cn: 删除工具

# MainWindow_SplashTitle.Text
source: Zhenxing AI Assistant
zh_cn: 枕星图吧AI助手

# MainWindow_SplashStatus.Text
source: Starting up...
zh_cn: 正在初始化...

# MainWindow_SearchPlaceholder.PlaceholderText
source: Search tools and settings...
zh_cn: 搜索工具、设置...

# MainWindow_AiButton.ToolTip
source: AI Assistant
zh_cn: AI 助手

# MainWindow_NewbieTutorialButton.ToolTip
source: Getting Started
zh_cn: 新手教程

# MainWindow_NavAll.Content
source: All
zh_cn: 全部

# MainWindow_NavFavorites.Content
source: Favorites
zh_cn: 常用

# MainWindow_NavHardware.Content
source: Hardware
zh_cn: 硬件信息

# MainWindow_NavBuiltin.Content
source: Built-in
zh_cn: 内置

# MainWindow_NavBenchmark.Content
source: Benchmarks
zh_cn: 性能测试

# MainWindow_NavCommunity.Content
source: Community
zh_cn: 社区

# MainWindow_AiButton
source: AI Assistant
zh_cn: AI 助手

# MainWindow_NewbieTutorialButton
source: Getting Started
zh_cn: 新手教程

# MainWindow_DownloadQueueButton
source: Downloads
zh_cn: 下载队列

# MainWindow_NavSettings
source: Settings
zh_cn: 设置

# MainWindow_BuiltinToolFallback
source: Built-in Tool
zh_cn: 内置工具

# MainWindow_ToolUpdateDoneTitle
source: Tool updated
zh_cn: 工具更新完成

# MainWindow_ToolUpdateDoneMessage
source: "{0}" has been updated to the latest version
zh_cn: 「{0}」已更新到最新版本

# MainWindow_ToolUpdateProgressTitle
source: Updating tool
zh_cn: 正在更新工具

# MainWindow_ToolUpdateProgressMessage
source: Updating "{0}"...
zh_cn: 「{0}」正在同步更新...

# MainWindow_ToolUpdateFailedTitle
source: Tool update failed
zh_cn: 工具更新失败

# MainWindow_ToolUpdateFailedMessage
source: Failed to update "{0}": {1}
zh_cn: 「{0}」更新失败：{1}

# HomePage_EditOrderButton.ToolTip
source: Enter reorder mode, then drag cards up or down
zh_cn: 进入排序模式，按住卡片上下拖动调整顺序

# HomePage_EditOrderButtonText.Text
source: Reorder
zh_cn: 编辑排序

# HomePage_EditOrderButtonText
source: Reorder
zh_cn: 编辑排序

# HomePage_FavoriteButton.ToolTip
source: Favorite
zh_cn: 收藏

# HomePage_SendToDesktopButton.ToolTip
source: Send to Desktop
zh_cn: 发送到桌面快捷方式

# HomePage_RunAsAdminButton.ToolTip
source: Run as Administrator
zh_cn: 以管理员身份运行

# HomePage_DropHintFooter.Text
source: Drop a zip/exe/ps1/bat here to add your own tool. Right-click a tool for more actions.
zh_cn: 拖入 zip/exe/ps1/bat 可添加自己的工具，右键可以对工具执行更多操作

# HomePage_EditModeHint.Text
source: Drag any row up or down to reorder, then click "Done" in the top-right corner.
zh_cn: 按住任意行上下拖动即可调整顺序，完成后点击右上角“完成”。

# HomePage_EmptyStateTitle.Text
source: No matching tools
zh_cn: 没有找到匹配的工具

# HomePage_DownloadToolsButton.Text
source: Download Tool Pack
zh_cn: 下载工具包

# HomePage_ToolDetailTip.CloseButtonContent
source: Close
zh_cn: 关闭

# HomePage_TitleSearch
source: Search: {0}
zh_cn: 搜索：{0}

# HomePage_TitleTag
source: Tag: {0}
zh_cn: 标签：{0}

# HomePage_SubtitleSearch
source: Showing matching tools from all categories.
zh_cn: 显示所有分类中匹配的工具。

# HomePage_SubtitleTag
source: Showing tools tagged "{0}".
zh_cn: 显示带有「{0}」标签的工具。

# HomePage_SubtitleAll
source: Pick a category on the left, click a card for details, or click a card to launch a tool.
zh_cn: 从左侧选择分类，点击卡片看详情，点击打开运行工具。

# HomePage_SubtitleCategory
source: Browsing the "{0}" category.
zh_cn: 正在浏览“{0}”分类。

# HomePage_ToolCount
source: {0} tools
zh_cn: {0} 个工具

# HomePage_EmptySearch
source: No tools found for "{0}".
zh_cn: 未找到与“{0}”相关的工具。

# HomePage_EmptyTag
source: No tools tagged "{0}".
zh_cn: 未找到带有「{0}」标签的工具。

# HomePage_EmptyCategory
source: No tools available in this category.
zh_cn: 此分类下没有可用工具。

# HomePage_EmptyAll
source: No tools found. Check the Tools folder.
zh_cn: 没有找到任何工具，请检查 Tools 目录。

# HomePage_TutorialWindowTitle
source: {0} - Tutorial
zh_cn: {0} - 使用教程

# HomePage_DetailType
source: Type: {0}
zh_cn: 类型：{0}

# HomePage_DetailPublisher
source: Publisher: {0}
zh_cn: 发布者：{0}

# HomePage_DetailVersion
source: Version: {0}
zh_cn: 版本：{0}

# HomePage_LaunchFileMissing
source: File not found: {0}
zh_cn: 找不到文件：{0}

# HomePage_InstallScriptTitle
source: Install {0}
zh_cn: 安装 {0}

# HomePage_BuiltinNotFound
source: Built-in tool not found
zh_cn: 找不到对应的内置工具

# HomePage_WingetInstallingMessage
source: Installing "{0}" via winget...
zh_cn: 正在通过 winget 安装「{0}」...

# HomePage_WingetInstalledMessage
source: "{0}" installed. Click to open.
zh_cn: 「{0}」安装成功，点击打开即可使用。

# HomePage_DeleteDialogTitle
source: Delete "{0}"
zh_cn: 删除「{0}」

# HomePage_DeleteDialogConfirm
source: Delete this tool? This cannot be undone!
zh_cn: 确定要删除此工具吗？此操作不可撤销！

# HomePage_DeleteDialogDetail
source: The tool folder and all related files will be deleted:
zh_cn: 将会删除工具所在目录及所有相关文件：

# HomePage_ImportNoWindow
source: Window unavailable, please try again
zh_cn: 无法获取窗口，请重试

# HomePage_ImportUnreadable
source: Unable to read file
zh_cn: 无法读取文件

# HomePage_ImportNoExeTitle
source: No importable tool found
zh_cn: 未找到可导入工具

# HomePage_ImportNoExeMessage
source: The archive must contain at least one .exe file.
zh_cn: 压缩包里需要至少包含一个 .exe 文件。

# HomePage_ImportSuccessMessage
source: Imported {0}
zh_cn: 已导入 {0}

# Favorites_Title.Text
source: Favorites
zh_cn: 收藏

# Favorites_Subtitle.Text
source: Your favorited tools and AI cards appear here. Use "Reorder" on tool cards to change the order.
zh_cn: 你收藏的工具和 AI 卡片都在这里；工具卡可点「编辑排序」调整顺序。

# Favorites_FrequentTitle.Text
source: Frequently Used
zh_cn: 常用推荐

# Favorites_FrequentSubtitle.Text
source: Sorted by usage frequency
zh_cn: 基于使用频率智能排序

# Favorites_MyFavorites.Text
source: Toolbox Favorites
zh_cn: 图吧收藏

# Favorites_EditOrderButtonText.Text
source: Reorder
zh_cn: 编辑排序

# Favorites_EditOrderButtonText
source: Reorder
zh_cn: 编辑排序

# Favorites_ClearAll.Text
source: Clear All
zh_cn: 清空全部

# Favorites_SendToDesktopButton.ToolTip
source: Send to Desktop
zh_cn: 发送到桌面快捷方式

# Favorites_RunAsAdminButton.ToolTip
source: Run as Administrator
zh_cn: 以管理员身份运行

# Favorites_RemoveFavoriteButton.ToolTip
source: Unfavorite
zh_cn: 取消收藏

# Favorites_EditModeHint.Text
source: Drag any card up or down to reorder, then click "Done" in the top-right corner.
zh_cn: 按住任意卡片上下拖动即可调整顺序，完成后点击右上角“完成”。

# Favorites_EmptyTitle.Text
source: No favorites yet
zh_cn: 还没有收藏的工具

# Favorites_EmptyHint.Text
source: Click the star button on the All page to add favorites
zh_cn: 在全部页面点击星标按钮即可收藏

# Favorites_ToolDetailTip.CloseButtonContent
source: Close
zh_cn: 关闭

# Favorites_FrequentSubtitleTop
source: Sorted by usage frequency · top {0}
zh_cn: 基于使用频率智能排序 · 前 {0} 个

# Favorites_FrequentSubtitleCount
source: Sorted by usage frequency · {0}
zh_cn: 基于使用频率智能排序 · {0} 个

# Favorites_NoFavorites
source: No favorites
zh_cn: 暂无收藏

# Favorites_LoadFailed
source: Failed to load
zh_cn: 加载失败

# Favorites_FavoriteCount
source: {0} favorites
zh_cn: 已收藏 {0} 个工具

# Favorites_ClearAllDialogTitle
source: Clear all favorites
zh_cn: 清空全部收藏

# Favorites_ClearAllDialogMessage
source: Remove all tools from favorites? This cannot be undone.
zh_cn: 确定要取消所有工具的收藏吗？此操作不可撤销。

# Favorites_ClearAllDialogPrimary
source: Clear
zh_cn: 清空

# Search_KindTool
source: Tool
zh_cn: 工具

# Search_KindBuiltin
source: Built-in
zh_cn: 内置

# Search_KindSetting
source: Setting
zh_cn: 设置

# Search_KindCustom
source: Custom
zh_cn: 自定义

# Search_KindQuick
source: Quick
zh_cn: 快捷

# Search_KindCommunity
source: Community
zh_cn: 社区

# Search_CustomSubtitle
source: Custom · {0}
zh_cn: 自定义 · {0}

# Search_SettingTheme
source: App theme
zh_cn: 应用主题

# Search_SettingThemeDesc
source: Choose light, dark, or follow system
zh_cn: 选择浅色、深色或跟随系统

# Search_SettingCompact
source: Compact list mode
zh_cn: 简洁列表模式

# Search_SettingCompactDesc
source: The classic Tuba Toolbox style
zh_cn: 原版图吧工具箱的样式

# Search_SettingDefaultPage
source: Default page
zh_cn: 默认启动页面

# Search_SettingDefaultPageDesc
source: Choose the page shown on startup
zh_cn: 选择应用启动后默认打开的页面

# Search_SettingFastMode
source: Fast mode
zh_cn: 快速模式

# Search_SettingFastModeDesc
source: Disable all animations for faster response
zh_cn: 禁用所有动画，提升响应速度

# Search_SettingRememberWindow
source: Remember window position and size
zh_cn: 记住窗口位置和大小

# Search_SettingRememberWindowDesc
source: Restore the window on next launch
zh_cn: 关闭后下次启动恢复位置

# Search_SettingBackground
source: Background image
zh_cn: 背景图片

# Search_SettingBackgroundDesc
source: Import an image as the main page background
zh_cn: 导入图片作为主页面背景

# Search_SettingUpdate
source: Check for updates
zh_cn: 检查更新

# Search_SettingUpdateDesc
source: Check whether a new version is available
zh_cn: 检查是否有新版本

# Search_SettingConfigManager
source: Config manager
zh_cn: 配置管理

# Search_SettingConfigManagerDesc
source: Manage config storage location, export and import
zh_cn: 管理配置文件的存储位置、导出和导入

# Search_SettingCustomToolManager
source: Custom tool manager
zh_cn: 自定义工具管理

# Search_SettingCustomToolManagerDesc
source: Manage categories and import custom tools
zh_cn: 管理工具分类、导入自定义工具

# Search_QuickHardware
source: Hardware info
zh_cn: 硬件信息

# Search_QuickHardwareDesc
source: View CPU, GPU, memory and other hardware details
zh_cn: 查看处理器、显卡、内存等硬件信息

# Search_QuickFavorites
source: Favorite tools
zh_cn: 常用工具

# Search_QuickFavoritesDesc
source: View your favorite tools
zh_cn: 查看收藏的工具

# Search_QuickBuiltin
source: Built-in tools
zh_cn: 内置工具

# Search_QuickBuiltinDesc
source: System tools that need no external files
zh_cn: 无需外部文件的系统工具

# Search_QuickSettings
source: Settings
zh_cn: 设置

# Search_QuickSettingsDesc
source: App appearance and feature settings
zh_cn: 应用外观和功能设置

# Settings_LanguageTitle.Text
source: Language
zh_cn: 界面语言

# Settings_LanguageDesc.Text
source: Choose the display language
zh_cn: 选择应用的显示语言

# Settings_LanguageAuto
source: Follow system
zh_cn: 跟随系统

# UpdateBanner_ChangelogButton.Content
source: Release notes
zh_cn: 更新说明

# UpdateBanner_ActionButton
source: Update Now
zh_cn: 开始更新

# UpdateBanner_ChangelogButton
source: Release notes
zh_cn: 更新说明

# UpdateBanner_CloseButton
source: Dismiss update notice
zh_cn: 关闭更新提示

# UpdateBanner_NewVersion
source: New version v{0} available
zh_cn: 发现新版本 v{0}

# UpdateBanner_Downloading
source: Downloading update...
zh_cn: 正在下载更新...

# UpdateBanner_DownloadingButton
source: Downloading
zh_cn: 下载中

# UpdateBanner_InvalidFile
source: The update file is invalid or was removed. Please download again.
zh_cn: 更新文件无效或已被清理，请重新下载

# UpdateBanner_Ready
source: Update ready. Click to install.
zh_cn: 更新已就绪，点击开始安装

# UpdateBanner_InstallButton
source: Install Now
zh_cn: 立即安装

# UpdateBanner_DownloadFailed
source: Update download failed: {0}
zh_cn: 更新下载失败：{0}

# UpdateBanner_RetryButton
source: Retry
zh_cn: 重试

# UpdateBanner_LaunchFailedTitle
source: Update file unavailable
zh_cn: 更新文件不可用

# UpdateBanner_LaunchFailedMessage
source: The update package was removed or is corrupted (possibly by security software, cleanup tools, or disk errors) and cannot be launched. Please download it again.
zh_cn: 更新安装包已被移除或损坏（可能受安全软件、清理工具或磁盘错误影响），无法启动。请重新下载后再安装。

# UpdateBanner_RedownloadButton
source: Download Again
zh_cn: 重新下载

# UpdateBanner_OpenFolderButton
source: Open Download Folder
zh_cn: 打开下载文件夹

# Category_Processor
source: Processors
zh_cn: 处理器

# Category_Graphics
source: Graphics
zh_cn: 显卡

# Category_Display
source: Displays
zh_cn: 显示器

# Category_Storage
source: Storage
zh_cn: 硬盘

# Category_Memory
source: Memory
zh_cn: 内存

# Category_Peripherals
source: Peripherals
zh_cn: 外设

# Category_Gaming
source: Gaming
zh_cn: 游戏

# Category_Audio
source: Audio
zh_cn: 声卡

# Category_Network
source: Network
zh_cn: 网卡

# Category_StressTest
source: Stress Test
zh_cn: 烤鸡

# Category_GeneralCheck
source: Diagnostics
zh_cn: 综合检测

# Category_General
source: General
zh_cn: 综合

# Category_Other
source: Other
zh_cn: 其他

# Category_Builtin_System
source: System
zh_cn: 系统工具

# Category_Builtin_Hardware
source: Hardware
zh_cn: 硬件工具

# Category_Builtin_Network
source: Network
zh_cn: 网络工具

# Category_Builtin_Gaming
source: Gaming
zh_cn: 游戏工具

# Category_Builtin_Utility
source: Utilities
zh_cn: 实用工具

# Common_ExportFailed
source: Export failed
zh_cn: 导出失败

# Common_GotIt
source: Got it
zh_cn: 知道了

# Settings_ActiveIntercept_Desc.Text
source: Off by default. When enabled, monitors context menus in the background and blocks new third-party entries. Review and allow entries on the active interception page.
zh_cn: 默认关闭。开启后在后台监控右键菜单注册项，自动拦截新增的第三方菜单；可在主动拦截页审核放行。

# Settings_ActiveIntercept_Title.Text
source: Active intercept
zh_cn: 主动拦截流氓软件

# Settings_Ai_Status.Text
source: Configure an AI provider and model to enable AI features
zh_cn: 配置 AI 提供商与模型，启用 AI 智能功能

# Settings_Ai_Title.Text
source: AI connection and model
zh_cn: AI 接口与模型

# Settings_AiAddModel_Button.Text
source: Add
zh_cn: 添加

# Settings_AiApiKey_GetButton.Text
source: Get API Key
zh_cn: 获取 API Key

# Settings_AiApiKey_Hint
source: API key, stored securely on this device
zh_cn: API 密钥，将安全保存在本地

# Settings_AiApiKey_Hint.Text
source: API key, stored securely on this device
zh_cn: API 密钥，将安全保存在本地

# Settings_AiConfigured
source: Configured: {0} · {1}
zh_cn: 已配置：{0} · {1}

# Settings_AiDefaultModel_Desc.Text
source: Shared by chat, Agent and news summaries; current replies finish before using the new configuration
zh_cn: 聊天、Agent 和资讯摘要统一使用；进行中的回复完成后使用新配置

# Settings_AiDefaultModel_Title.Text
source: Global model
zh_cn: 全局模型

# Settings_AiEndpoint_Desc.Text
source: Enter an OpenAI-compatible service URL shared by chat, Agent and news summaries
zh_cn: 填写 OpenAI 兼容 API 的服务地址；聊天、Agent 和资讯摘要共用此地址

# Settings_AiEndpoint_Title.Text
source: API endpoint
zh_cn: API 地址

# Settings_AiKeyHintZen
source: API Key (optional): leave blank for the anonymous free tier (low quota); signing in raises the quota significantly
zh_cn: API Key（可选）：留空使用匿名免费模型（额度低）；登录获取 Key 后额度大幅提升

# Settings_AiModels_Desc.Text
source: Preset or custom model IDs, switchable any time in the AI chat
zh_cn: 预设或自定义模型标识，可在 AI 聊天界面随时切换

# Settings_AiModels_Title.Text
source: Models
zh_cn: 模型列表

# Settings_AiNewModel_Placeholder.PlaceholderText
source: Enter a model ID, e.g. deepseek-chat
zh_cn: 输入模型标识，如 deepseek-chat

# Settings_AiProvider_AddButton.Text
source: New custom
zh_cn: 新建自定义

# Settings_AiProvider_Desc.Text
source: Built-in DeepSeek / Xiaomi MiMo / OpenCode Zen presets only need an API Key; custom providers are fully editable
zh_cn: 内置 DeepSeek / 小米 MiMo / OpenCode Zen 预设，只需填写 API Key；自定义提供商可完全编辑

# Settings_AiProvider_ResetButton.Text
source: Reset to default
zh_cn: 恢复默认

# Settings_AiProvider_Title.Text
source: AI provider
zh_cn: AI 提供商

# Settings_AiTest_Button
source: Test connection
zh_cn: 测试连接

# Settings_AiTest_Button.Text
source: Test connection
zh_cn: 测试连接

# Settings_AiTestFailed
source: Connection failed
zh_cn: 连接失败

# Settings_AiTestFailedDialogTitle
source: AI connection test failed
zh_cn: AI 连接测试失败

# Settings_AiTestFailedStatus
source: Connection failed: {0}
zh_cn: 连接失败：{0}

# Settings_AiTesting
source: Testing...
zh_cn: 测试中...

# Settings_AiTestSuccess
source: Connected
zh_cn: 连接成功

# Settings_AiTestSuccessStatus
source: AI service configured, connection test succeeded
zh_cn: AI 服务已配置，连接测试成功

# Settings_AiUsingDefaultModel
source: ⚠️ Using the built-in default model: expect queues and rate limits with lower quality. DeepSeek V4 Pro is recommended.
zh_cn: ⚠️ 使用自带默认模型，可能出现排队/限额满速，质量低下等问题。推荐使用 DeepSeek V4 Pro。

# Settings_AiZen_Desc.Text
source: Free models (such as deepseek-v4-flash-free, mimo-v2.5-free) cost nothing; the anonymous quota is low (~2 rounds in practice), and signing in with an API Key raises it significantly.
zh_cn: 免费模型（如 deepseek-v4-flash-free、mimo-v2.5-free）无需付费；匿名使用额度较低（实测约 2 轮即限额），登录并填入 API Key 后额度大幅提升。

# Settings_AiZen_LoginButton
source: Sign in and get Key
zh_cn: 登录并获取 Key

# Settings_AiZen_LoginButton.Text
source: Sign in and get Key
zh_cn: 登录并获取 Key

# Settings_AiZen_RefreshButton
source: Refresh free models
zh_cn: 刷新免费模型

# Settings_AiZen_RefreshButton.Text
source: Refresh free models
zh_cn: 刷新免费模型

# Settings_AiZen_Title.Text
source: OpenCode Zen free models
zh_cn: OpenCode Zen 免费模型

# Settings_AiZenGetKeyFailed
source: Failed to get Key: {0}
zh_cn: 获取 Key 失败：{0}

# Settings_AiZenHasKey
source: Key configured: {0} (higher quota)
zh_cn: 已配置 Key：{0}（额度更高）

# Settings_AiZenNoKey
source: No Key configured (low anonymous quota)
zh_cn: 未配置 Key（匿名额度较低）

# Settings_AiZenRefreshed
source: Refreshed {0} free models
zh_cn: 已刷新 {0} 个免费模型

# Settings_AiZenRefreshFailed
source: Refresh failed: {0}
zh_cn: 刷新失败：{0}

# Settings_AiZenRefreshing
source: Refreshing...
zh_cn: 刷新中...

# Settings_AiZenWaitingLogin
source: Waiting for sign-in...
zh_cn: 等待登录...

# Settings_AllFilesFilter
source: All files
zh_cn: 所有文件

# Settings_Appearance_Desc.Text
source: Window material, background image and interface font
zh_cn: 窗口材质、背景图片、界面字体

# Settings_Appearance_Title.Text
source: Appearance
zh_cn: 外观

# Settings_AppSubtitle.Text
source: The AI assistant is central: describe the project you want to make. It clarifies your goal and constraints, assembles optional toolflows (preferring built-in tools), and installs and configures what it can. It guides you through steps that require sign-up, sign-in, or payment. Tuba Toolbox adds ready-made tools and troubleshooting.
zh_cn: 以 AI 助手为核心：说出想做的项目，先理解目标和约束，再组合可选工具流（优先应用内现成工具）并把能自动的装好配好；需要注册、登录或付费的步骤会逐步引导。图吧工具箱是附加的现成工具与排障底座。

# Settings_AppTitle.Text
source: Zhenxing AI Assistant
zh_cn: 枕星图吧AI助手

# Settings_Backdrop_Desc.Text
source: Pick the window backdrop material and optionally customize the tint
zh_cn: 选择窗口背景的视觉材质效果，并可自定义色调

# Settings_Backdrop_Title.Text
source: Window material
zh_cn: 窗口材质

# Settings_BackdropAcrylic_Desc.Text
source: Frosted glass
zh_cn: 磨砂玻璃

# Settings_BackdropAcrylic_Title.Text
source: Acrylic
zh_cn: 亚克力

# Settings_BackdropAcrylicThin_Desc.Text
source: Lighter frost
zh_cn: 更透亮的磨砂

# Settings_BackdropAcrylicThin_Title.Text
source: Acrylic Thin
zh_cn: 细亚克力

# Settings_BackdropMica_Desc.Text
source: Soft mica
zh_cn: 柔和云母

# Settings_BackdropMicaAlt_Desc.Text
source: Layered mica
zh_cn: 层次云母

# Settings_Background_Desc.Text
source: Import an image as the main page background
zh_cn: 导入图片作为主页面背景

# Settings_Background_Title.Text
source: Background image
zh_cn: 背景图片

# Settings_BackgroundClear_Button.Text
source: Clear
zh_cn: 清除

# Settings_BackgroundImport_Button.Text
source: Import image
zh_cn: 导入图片

# Settings_BackgroundOpacity_Label.Text
source: Opacity
zh_cn: 透明度

# Settings_BgHistory_Empty.Text
source: No images imported yet
zh_cn: 还没有导入过图片

# Settings_BgHistory_Title.Text
source: Imported images
zh_cn: 已导入的图片

# Settings_BuiltinOpenMode_Desc.Text
source: Open built-in tools embedded in the current page, or in a separate window
zh_cn: 选择打开内置工具时嵌入当前页面，还是打开独立窗口

# Settings_BuiltinOpenMode_Title.Text
source: Built-in tool open mode
zh_cn: 内置工具打开方式

# Settings_BuiltinOpenModeOptionEmbedded
source: Embedded page
zh_cn: 嵌入页面

# Settings_BuiltinOpenModeOptionWindow
source: Separate window
zh_cn: 独立窗口

# Settings_CommunitySubmit_Button.Text
source: Submit tool
zh_cn: 提交工具

# Settings_Compact_Desc.Text
source: The classic Tuba Toolbox style
zh_cn: 原版图吧工具箱的样式

# Settings_Compact_Title.Text
source: Compact list mode
zh_cn: 简洁列表模式

# Settings_ConfigManager_Button.Text
source: Manage
zh_cn: 管理

# Settings_ConfigManager_Desc.Text
source: Manage config storage location, export and import
zh_cn: 管理配置文件的存储位置、导出和导入

# Settings_ConfigManager_Title.Text
source: Config manager
zh_cn: 配置管理

# Settings_CpuzButtonRevert
source: Use default
zh_cn: 切回默认

# Settings_CpuzDialogPrimary
source: Switch
zh_cn: 确认切换

# Settings_CpuzDialogTitle
source: Switch hardware info data source
zh_cn: 切换硬件信息数据源

# Settings_CpuzFetchError
source: An error occurred while reading data with CPU-Z: {0}
zh_cn: CPU-Z 获取过程中出现错误： {0}

# Settings_CpuzFetchFailedMessage
source: CPU-Z could not read the hardware information. Possible reasons: • CPU-Z timed out • CPU-Z was blocked by security software • This CPU-Z build does not support the current architecture
zh_cn: CPU-Z 未能成功获取硬件信息。 可能原因： • CPU-Z 运行超时 • CPU-Z 被安全软件拦截 • 当前架构不支持此版本 CPU-Z

# Settings_CpuzFetchFailedTitle
source: Read failed
zh_cn: 获取失败

# Settings_CpuzFetching
source: Reading hardware information via CPU-Z, please wait...
zh_cn: 正在通过 CPU-Z 获取硬件信息，请稍候...

# Settings_CpuzHowBody
source: CPU-Z reads CPU registers directly through the CPUID instruction, enumerates hardware via PCI, and reads memory modules via the SPD chip — data at the hardware level that vendors cannot fake by editing SMBIOS.
zh_cn: CPU-Z 通过 CPUID 指令直接读取 CPU 硬件寄存器，通过 PCI 枚举直接扫描硬件，通过 SPD 芯片直接读取内存条信息——这些是底层硬件级别的数据，厂商无法通过修改 SMBIOS 来伪造。

# Settings_CpuzHowTitle
source: ✓ How CPU-Z reads data
zh_cn: ✓ CPU-Z 读取原理

# Settings_CpuzIntro
source: Hardware information currently comes from WMI (Windows Management Instrumentation), based on what the vendor wrote into SMBIOS/DMI.
zh_cn: 当前硬件信息通过 WMI（Windows 管理规范）获取，数据来源于厂商在 SMBIOS/DMI 中填写的内容。

# Settings_CpuzNotesBody
source: • Reading with CPU-Z takes about 3-8 seconds and briefly starts the CPU-Z process • The CPU-Z process is closed automatically afterwards • You can switch back to the WMI source at any time in Settings
zh_cn: • 使用 CPU-Z 获取信息需要约 3~8 秒，期间会短暂启动 CPU-Z 进程 • 获取完成后会自动关闭 CPU-Z 进程 • 切换后可在设置中随时切回 WMI 数据源

# Settings_CpuzNotesTitle
source: ⏱ Notes
zh_cn: ⏱ 注意事项

# Settings_CpuzNotFoundMessage
source: CPU-Z was not found in the tools folder, so this feature is unavailable. Make sure cpuz_x64.exe exists under Tools/处理器工具/CPUZ/.
zh_cn: 在工具目录中未找到 CPU-Z 可执行文件，无法使用此功能。 请确保 Tools/处理器工具/CPUZ/ 目录下存在 cpuz_x64.exe。

# Settings_CpuzNotFoundTitle
source: CPU-Z not found
zh_cn: 未找到 CPU-Z

# Settings_CpuzSource_Button
source: Switch
zh_cn: 切换

# Settings_CpuzSource_Button.Text
source: Switch
zh_cn: 切换

# Settings_CpuzSource_Status.Text
source: Read real hardware information with CPU-Z to prevent vendor spoofing
zh_cn: 使用 CPU-Z 读取真实硬件信息，防止厂商伪造

# Settings_CpuzSource_Title.Text
source: Hardware info data source
zh_cn: 硬件信息数据源
